src/DataProcessors/ИмпортТабличныхЧастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИмпортТабличныхЧастей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСоответсвийПолей</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>Упрощенная </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИмпортТабличныхЧастей/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьНастройкиФормы();
	Если ПоискПоТипу = 0 Тогда
		ПоискПоТипу = 1;
	КонецЕсли;		
	ПоискПоТипуПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриЗакрытии" формы.
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиФормы();

КонецПроцедуры

&НаКлиенте
// Диалог выбора файла импортируемой информации.
//
Процедура ВыборФайлаИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла =	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр = "Файл импорта (*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	ФайлИмпорта;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, Элемент", ДиалогВыбораФайла, Элемент)));

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Элемент = ДополнительныеПараметры.Элемент;

	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ФайлИмпорта = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	ВыборФайлаИмпортаПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ВыборФайлаИмпортаПриИзменении(Элемент)
	
	ЧитаемыйФайл = Новый Файл(ФайлИмпорта);
	
	ЧитаемыйФайл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ВыборФайлаИмпортаПослеПроверки", ЭтотОбъект, Новый Структура("ЧитаемыйФайл", ЧитаемыйФайл)));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор файла импорта после проверки
//
// Параметры:
//  ПроверкаПройдена		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборФайлаИмпортаПослеПроверки(ПроверкаПройдена, ДополнительныеПараметры) Экспорт
	
	ЧитаемыйФайл = ДополнительныеПараметры.ЧитаемыйФайл;
	
	Если НЕ ПроверкаПройдена И НЕ ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась")
		//Если каталог
		ИЛИ ПроверкаПройдена И ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") Тогда
		ПоказатьПредупреждение(,"Выберите файл загрузки."); 
	ИначеЕсли НЕ ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") Тогда
		ЧитаемыйФайл.НачатьПроверкуЭтоКаталог(Новый ОписаниеОповещения("ВыборФайлаИмпортаПослеПроверки", ЭтотОбъект, Новый Структура("ЧитаемыйФайл, ПроверкаНаКаталогЗавершилась", ЧитаемыйФайл, Истина)));
		Возврат;
	Иначе
		ВыборФайлаИмпортаПриИзмененииЗавершение(ЧитаемыйФайл);
	КонецЕсли; 
	
КонецПроцедуры  

&НаКлиенте
// Процедура - Выбор файла импорта при изменении завершение
//
// Параметры:
//  ЧитаемыйФайл - 	 - 
//
Процедура ВыборФайлаИмпортаПриИзмененииЗавершение(ЧитаемыйФайл)
	
	// Определение типа читаемого файла
	Расширение = нРег(ЧитаемыйФайл.Расширение);	
	Если нРег(Расширение) = ".xls" ИЛИ нРег(Расширение) = ".xlsx" Тогда
		
		ТипФайлаИмпорта = "EXCEL";
		Элементы.СимволРазделитель.Видимость = Ложь;
		
	КонецЕсли;
	
	// Получаем поля файла соответсвующе реквизитам справочника
	Если ПолучитьСтрокуНаимеванийРеквизитов() = Истина Тогда
		Элементы.ТаблицаСоответсвийПолейКолонкаФайла.СписокВыбора.ЗагрузитьЗначения(СписокКолонокФайла.ВыгрузитьЗначения());
		Элементы.Загрузить.Доступность = Истина;
	Иначе 
		ПоказатьПредупреждение(,"Оперция прервана. Импорт невозможен!");
		Элементы.Загрузить.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Загрузить.Доступность = НЕ ПустаяСтрока(ФайлИмпорта);
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "СоздаватьНенайденнуюНоменклатуру".
//
Процедура СоздаватьНенайденнуюНоменклатуруПриИзменении(Элемент)
	
	Элементы.ПапкаДляНовыйНоменклатуры.Доступность = СоздаватьНенайденнуюНоменклатуру;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Настройки".
//
Процедура Настройки(Команда)
	
	Элементы.ФормаНастройки.Пометка = НЕ Элементы.ФормаНастройки.Пометка;
	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаНастройки.Пометка;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Загрузить".
//
Процедура Загрузить(Команда)
	
	Если СоздаватьНенайденнуюНоменклатуру И ПапкаДляНовыйНоменклатуры.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Папка"" не заполнено.");
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Объект.ТаблицаСоответсвийПолей.НайтиСтроки(Новый Структура("РеквизитСправочника", КлючеваяСтрокаТЧ));
	ЗначениеКлючевойСтрокиТЧ = ?(МассивСтрок.Количество() > 0, МассивСтрок[0].КолонкаФайла, Неопределено);
	Если ПустаяСтрока(ЗначениеКлючевойСтрокиТЧ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Колонка файла"" по реквизиту "+КлючеваяСтрокаТЧ+" не заполнено.");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзExcel();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередУдалением" таблицы "ТаблицаСоответсвийПолей".
//
Процедура ТаблицаСоответсвийПолейПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередНачаломДобавления" таблицы "ТаблицаСоответсвийПолей".
//
Процедура ТаблицаСоответсвийПолейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "ПоискПоТипу".
//
Процедура ПоискПоТипуПриИзменении(Элемент)
	
	Если ПоискПоТипу = 1 Или ПоискПоТипу = 3 Тогда 
		Элементы.СоздаватьНенайденнуюНоменклатуру.Доступность = Истина; 
		Элементы.ПапкаДляНовыйНоменклатуры.Доступность = Истина;
		СоздаватьНенайденнуюНоменклатуру = Истина;
	ИначеЕсли ПоискПоТипу = 2 Тогда
		Элементы.СоздаватьНенайденнуюНоменклатуру.Доступность = Ложь; 
		Элементы.ПапкаДляНовыйНоменклатуры.Доступность = Ложь;
		СоздаватьНенайденнуюНоменклатуру = Ложь;
	КонецЕсли;	
	Элементы.ПапкаДляНовыйНоменклатуры.Доступность = СоздаватьНенайденнуюНоменклатуру;
	ЗаполнитьТаблицуСоответствийПолей();
	
КонецПроцедуры

&НаКлиенте
// Процедура заполняет таблицу "ТаблицаСоответствийПолей" значениями, в зависимости от поля "ПоискПоТипу".
//
Процедура ЗаполнитьТаблицуСоответствийПолей()
	
	Объект.ТаблицаСоответсвийПолей.Очистить();	
	Если ПоискПоТипу = 1 Тогда
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Наименование";
		СтрокаТЧ.ОтметкаНезаполненного = Истина;
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Артикул";
		СтрокаТЧ.ОтметкаНезаполненного = Ложь;		
		КлючеваяСтрокаТЧ = "Наименование";
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Штрихкод";
		СтрокаТЧ.ОтметкаНезаполненного = Ложь;		
		
	ИначеЕсли ПоискПоТипу = 2 Тогда 
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Штрихкод";
		СтрокаТЧ.ОтметкаНезаполненного = Истина;		
		КлючеваяСтрокаТЧ = "Штрихкод";
	ИначеЕсли ПоискПоТипу = 3 Тогда
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Наименование";
		СтрокаТЧ.ОтметкаНезаполненного = Ложь;		
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Артикул";
		СтрокаТЧ.ОтметкаНезаполненного = Истина;		
		КлючеваяСтрокаТЧ = "Артикул";
		СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
		СтрокаТЧ.РеквизитСправочника = "Штрихкод";
		СтрокаТЧ.ОтметкаНезаполненного = Ложь;		
		
	КонецЕсли;
	СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
	СтрокаТЧ.РеквизитСправочника = "Количество";
	СтрокаТЧ.ОтметкаНезаполненного = Ложь;			
	СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
	СтрокаТЧ.РеквизитСправочника = "Упаковка";
	СтрокаТЧ.ОтметкаНезаполненного = Ложь;			
	СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
	СтрокаТЧ.РеквизитСправочника = "Цена";
	СтрокаТЧ.ОтметкаНезаполненного = Ложь;	
	СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
	СтрокаТЧ.РеквизитСправочника = "Норма времени";
	СтрокаТЧ.ОтметкаНезаполненного = Ложь;	
	СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
	СтрокаТЧ.РеквизитСправочника = "Упаковка по умолчанию";
	СтрокаТЧ.ОтметкаНезаполненного = Ложь;	
	СтрокаТЧ = Объект.ТаблицаСоответсвийПолей.Добавить();
	СтрокаТЧ.РеквизитСправочника = "Коэффициент упаковки по умолчанию";
	СтрокаТЧ.ОтметкаНезаполненного = Ложь;	
	
КонецПроцедуры

&НаСервере
// Процедура сохраняет настройки формы.
//
Процедура СохранитьНастройкиФормы()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ПоискПоТипу", 						ПоискПоТипу);
	СтруктураНастроек.Вставить("СоздаватьНенайденнуюНоменклатуру", 	СоздаватьНенайденнуюНоменклатуру);
	СтруктураНастроек.Вставить("ПапкаДляНовыйНоменклатуры", 		ПапкаДляНовыйНоменклатуры);
	СтруктураНастроек.Вставить("ПометкаКнопкиНастройка", 			Элементы.ФормаНастройки.Пометка);
	                                                  
	ХранилищеНастроекДанныхФорм.Сохранить("ОбработкаИмпортТабличныхЧастей", "СтруктураНастроек", СтруктураНастроек);
	
КонецПроцедуры

&НаКлиенте
// Процедура загружает настройки формы.
//
Процедура ЗагрузитьНастройкиФормы()
	
	СтруктураНастроек = ПолучитьЗначениеНастроекФормы();
	
	НачтройкиОбнаружены = Истина;
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		НачтройкиОбнаружены = Ложь;
	Иначе
		НачтройкиОбнаружены = Истина;
	КонецЕсли;
	
	// Установим сохраненные значения
	Если НачтройкиОбнаружены И  СтруктураНастроек.Свойство("ПоискПоТипу") Тогда
		ПоискПоТипу = СтруктураНастроек.ПоискПоТипу;
	КонецЕсли;
	Если НачтройкиОбнаружены И  СтруктураНастроек.Свойство("СоздаватьНенайденнуюНоменклатуру") Тогда
		СоздаватьНенайденнуюНоменклатуру = СтруктураНастроек.СоздаватьНенайденнуюНоменклатуру;
	КонецЕсли;
	Если НачтройкиОбнаружены И  СтруктураНастроек.Свойство("ПапкаДляНовыйНоменклатуры") Тогда
		ПапкаДляНовыйНоменклатуры = СтруктураНастроек.ПапкаДляНовыйНоменклатуры;
	КонецЕсли;
	Если НачтройкиОбнаружены И  СтруктураНастроек.Свойство("ПометкаКнопкиНастройка") Тогда
		Элементы.ФормаНастройки.Пометка = СтруктураНастроек.ПометкаКнопкиНастройка;
		Элементы.ГруппаНастройки.Видимость = СтруктураНастроек.ПометкаКнопкиНастройка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция возвращает значения настроект формы.
//
Функция ПолучитьЗначениеНастроекФормы()
	
	Результат = ХранилищеНастроекДанныхФорм.Загрузить("ОбработкаИмпортТабличныхЧастей", "СтруктураНастроек");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
// Получить наименования реквизитов.
//
Функция ПолучитьСтрокуНаимеванийРеквизитов()
	
	ТекстСостояния = "Производится анализ выбранного файла";
	ТекстПояснения = "Это может занять некоторое время. Пожалуйста, подождите...";
	Картинка	   = БиблиотекаКартинок.ДлительнаяОперация48;
	
	Состояние(ТекстСостояния, , ТекстПояснения, Картинка);
	
	СписокКолонокФайла.Очистить();
	Если ТипФайлаИмпорта = "EXCEL" Тогда
		
		Рез = ПолучитьПоляИзExcel();
		Если НЕ Рез = "" Тогда
			ПоказатьПредупреждение(,Рез);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокКолонокФайла.Количество() = 0 Тогда 		 
		ПоказатьПредупреждение(,"Не удалось получить строку наименований реквизитов. Убедитесь, что данная строка расположена в файле первой по счету!");
		Возврат Ложь;
	Иначе		   
		Возврат Истина;	   
	КонецЕсли; 		  
КонецФункции

&НаКлиенте
// Получаем наименования полей из первой строки.
//
Функция ПолучитьПоляИзExcel()
	
	СписокКолонокФайла.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлИмпорта);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ТекстИсключение = ОписаниеОшибки();
		Возврат "Невозможно подключиться к файлу! " + ТекстИсключение;	 
	КонецПопытки;
	
	ColumnsCount = Excel.Cells.CurrentRegion.Columns.Count;		
	ДанныеСтроки = ИзСтрокиExcel(ExcelЛист, 1, ColumnsCount);
	Если ДанныеСтроки <> Неопределено Тогда
		СписокКолонокФайла = ДанныеСтроки;
	КонецЕсли;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	Возврат "";
	
КонецФункции

&НаКлиенте
// Получить список данных из строки Excel.
//
Функция ИзСтрокиExcel(ExcelЛист, НомерСтроки, КолСтолбцов)
	
	СписокПолей = Новый СписокЗначений;	
	ПустаяСтрока = Истина;
	
	Для Столбец = 1 По КолСтолбцов Цикл
		
		СписокПолей.Добавить(ExcelЛист.Cells(НомерСтроки, Столбец).Text, ExcelЛист.Cells(НомерСтроки, Столбец).Text);
		Если ExcelЛист.Cells(НомерСтроки, Столбец).Text <> "" Тогда
			ПустаяСтрока = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока Тогда
		Возврат Неопределено;
	Иначе
		Возврат СписокПолей;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Загрузка реквизитов справочника из таблицы Excel.
//
Процедура ЗагрузитьИзExcel()
	
	ТекстСостояния = "Выполнение импорта данных";
	Прогресс	   = 0;
	ТекстПояснения = "Это может занять продолжительное время...";
	Картинка 	   = БиблиотекаКартинок.ДлительнаяОперация48;
	Состояние(ТекстСостояния, Прогресс, ТекстПояснения, Картинка);
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлИмпорта);
		
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ТекстПредупреждения = "Невозможно открыть файл Microsoft Excel. Причина: " + ОписаниеОшибки();
		ПоказатьПредупреждение(,ТекстПредупреждения, , "Импорт номенклатуры");		 
	КонецПопытки;
	
	ОбщееКолСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	КолСтолбцов   = Excel.Cells.CurrentRegion.Columns.Count;
	
	// Количество строк файла, которые будут обработаны на сервере, после чего управление
	// вернется на клиент для отображения текущего прогресса.
	РазмерПорции = 50;
	
	ИндексТекущейСтроки 		= 2;
	СозданоЭлементовСправочника = 0;
	ДобавленоЭлементовВТЧ 		= 0;
	
	Пока ИндексТекущейСтроки <= ОбщееКолСтрок Цикл
		
		// Получаем очередную порцию данных.
		КолСтрокВПорции = ИндексТекущейСтроки + РазмерПорции;
		ПорцияДанных = Новый Массив;
		
		Пока ИндексТекущейСтроки <= Мин(ОбщееКолСтрок, КолСтрокВПорции) Цикл
			
			ДанныеСтрокиExcel = ИзСтрокиExcel(ExcelЛист, ИндексТекущейСтроки, КолСтолбцов);
			
			Если ДанныеСтрокиExcel <> Неопределено Тогда // Строка не пуста.
				ПорцияДанных.Добавить(ДанныеСтрокиExcel);
			КонецЕсли;
			
			ИндексТекущейСтроки = ИндексТекущейСтроки + 1;
			
		КонецЦикла;
		// Конец получения порции данных.
		
		Если ПорцияДанных.Количество() > 0 Тогда
			РезультатОбработки 			= ОбработатьПорциюНаСервере(ПорцияДанных); 
			СозданоЭлементовСправочника = РезультатОбработки.СозданоЭлементовСправочника + СозданоЭлементовСправочника;
			ДобавленоЭлементовВТЧ 		= РезультатОбработки.ДобавленоЭлементовВТЧ + ДобавленоЭлементовВТЧ;
		КонецЕсли;
		
		Прогресс = Цел(100 * ИндексТекущейСтроки / ОбщееКолСтрок);
		Состояние(ТекстСостояния, Прогресс, ТекстПояснения, Картинка);
		
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	ТекстПредупреждения = "Операция импортирования завершена успешно." + Символы.ПС
						+ "Обработано строк в файле: " + Формат(ИндексТекущейСтроки - 2, "ЧН=0") + Символы.ПС
						+ "Добавленно элементов в табличную часть: " + Формат(ДобавленоЭлементовВТЧ, "ЧН=0") + Символы.ПС
						+ "Создано элементов справочника Номенклатура: " + Формат(СозданоЭлементовСправочника, "ЧН=0");
						
	ПоказатьПредупреждение(,ТекстПредупреждения, , "Импорт номенклатуры");
	
	ЭтаФорма.Закрыть(ДанныеВТабличнуюЧасть);
	                                                                                 
КонецПроцедуры

&НаСервере
// Функция проводит обработку полученной порции из файла и возвращает количество загруженных элементов.
//
Функция ОбработатьПорциюНаСервере(ПорцияДанных)
	
	СозданоЭлементовСправочника = 0;
	ДобавленоЭлементовВТЧ		= 0;
	
	Для Каждого СписокЗначений Из ПорцияДанных Цикл
		
		СтруктураРеквизитов = Новый Структура();
		
		// Подстановка реквизитов в соответствии с колонками
		Для А = 0 По Объект.ТаблицаСоответсвийПолей.Количество() - 1 Цикл
			
			Строка = Объект.ТаблицаСоответсвийПолей[А];
			Если Строка.КолонкаФайла <> "" Тогда
				Идентификатор = СписокКолонокФайла.НайтиПоЗначению(Строка.КолонкаФайла).ПолучитьИдентификатор();
				СтруктураРеквизитов.Вставить(СтрЗаменить(Строка.РеквизитСправочника, " ", ""), СписокЗначений[Идентификатор].Значение);
			Иначе   
				СтруктураРеквизитов.Вставить(СтрЗаменить(Строка.РеквизитСправочника, " ", ""), "");
			КонецЕсли;
			
		КонецЦикла;			
		
		Результат = ЗаполнитьРеквизитыТабличнойЧасти(СтруктураРеквизитов);
		
		Если ТипЗнч(Результат.ЗначенияСтрокиТЧ) = Тип("Структура") Тогда
			ДанныеВТабличнуюЧасть.Добавить(Результат.ЗначенияСтрокиТЧ);
			ДобавленоЭлементовВТЧ = ДобавленоЭлементовВТЧ + 1;
		КонецЕсли;
		
		Если Результат.ОписаниеОшибки = Неопределено Тогда
			СозданоЭлементовСправочника = СозданоЭлементовСправочника + Результат.РезультатЗаписиЭлемента;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Новый Структура("СозданоЭлементовСправочника, ДобавленоЭлементовВТЧ", СозданоЭлементовСправочника, ДобавленоЭлементовВТЧ);
	
КонецФункции

&НаСервере
// Функция создает полученную из файла номенклатуру, если она отсутсвует в базе, а также создает и заполняет новый
// элемент табличной части документа.
//
Функция ЗаполнитьРеквизитыТабличнойЧасти(СтруктураРеквизитов)
	
	Если СтруктураРеквизитов.Количество() = 0 Тогда
		Возврат "Не найдено соответствий между наименованиями реквизитов и полями табличной части!";
	КонецЕсли;
	
	ЭлементСоздан = Истина;
	
	Попытка
		// Получаем значения реквизитов.
		Наименование 	 				= ВернутьЗначениеРевизита("Наименование"											, СтруктураРеквизитов);
		Штрихкод 		 				= ВернутьЗначениеРевизита("Штрихкод"												, СтруктураРеквизитов);
		Артикул			 				= ВернутьЗначениеРевизита("Артикул"													, СтруктураРеквизитов);
		Количество						= ВернутьЗначениеРевизита("Количество"												, СтруктураРеквизитов);   
		Упаковка		 				= ВернутьЗначениеРевизита("Упаковка"												, СтруктураРеквизитов);     
		Цена 			 				= ВернутьЗначениеРевизита("Цена"													, СтруктураРеквизитов);         
		НормаВремени 	 				= ВернутьЗначениеРевизита(СтрЗаменить("Норма времени", " ", "")						, СтруктураРеквизитов);   
		УпаковкаПоУмолчанию 			= ВернутьЗначениеРевизита(СтрЗаменить("Упаковка по умолчанию", " ", "")				, СтруктураРеквизитов);     
		КоэффициентУпаковкиПоУмолчанию 	= ВернутьЗначениеРевизита(СтрЗаменить("Коэффициент упаковки по умолчанию", " ", "")	, СтруктураРеквизитов);
		
		// Определяем существование номеклатуры.
		Если ПоискПоТипу = 1 Тогда
			СсылкаНомеклатуры = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
		ИначеЕсли ПоискПоТипу = 2 Тогда
			ЗаписьШтрихкода = РегистрыСведений.Штрихкоды.ПолучитьДанныеПоШтрихкодам(Штрихкод);
			Если ЗаписьШтрихкода.Свойство("Объект") Тогда
				СсылкаНомеклатуры = ЗаписьШтрихкода.Объект;
			Иначе
				СсылкаНомеклатуры = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли ПоискПоТипу = 3 Тогда
			Если НЕ ПустаяСтрока(Артикул) Тогда
				СсылкаНомеклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
			Иначе
				СсылкаНомеклатуры = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		
		Если СсылкаНомеклатуры.Пустая() И СоздаватьНенайденнуюНоменклатуру И
			((КлючеваяСтрокаТЧ = "Наименование" И НЕ(ПустаяСтрока(Наименование))) ИЛИ (КлючеваяСтрокаТЧ = "Артикул" И НЕ(ПустаяСтрока(Артикул)))) Тогда
			НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			НовыйЭлемент.Родитель 			= ПапкаДляНовыйНоменклатуры;  
			НовыйЭлемент.Наименование 		= Наименование;
			НовыйЭлемент.НаименованиеПолное = Наименование;
			НовыйЭлемент.ТипНоменклатуры 	= ПапкаДляНовыйНоменклатуры.ТипНоменклатуры;
			НовыйЭлемент.Артикул 			= Артикул;
			
			// По умолчанию единицы измерения ставим "шт".
			НовыйЭлемент.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
			
			// В зависимости от того, какая система налогообложения установленна в текущей структурной единице, устанавливаем ставку НДС.
			Если ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда					
				НовыйЭлемент.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;					
			Иначе					
				НовыйЭлемент.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;			
			КонецЕсли;
			
			НовыйЭлемент.Записать();
			
			СсылкаНомеклатуры = НовыйЭлемент.Ссылка;
					
			// Запись упаковки номеклатуры.
			Если Упаковка <> "" Тогда
				НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковка.Наименование = Упаковка;
				НоваяУпаковка.Владелец = НовыйЭлемент.Ссылка;
				НоваяУпаковка.Коэффициент = 1; 
				НоваяУпаковка.Записать();
			КонецЕсли;
           	Если КоэффициентУпаковкиПоУмолчанию <> "0" и  УпаковкаПоУмолчанию <> "" Тогда
            			НоваяУпаковкаПоУмолчанию = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
						НоваяУпаковкаПоУмолчанию.Наименование = УпаковкаПоУмолчанию;
						НоваяУпаковкаПоУмолчанию.Владелец = НовыйЭлемент.Ссылка;
						НоваяУпаковкаПоУмолчанию.Коэффициент = КоэффициентУпаковкиПоУмолчанию; 
						НоваяУпаковкаПоУмолчанию.Записать();
						НовыйЭлемент.УпаковкаПоУмолчанию = НоваяУпаковкаПоУмолчанию.Ссылка;
				КонецЕсли;
			НовыйЭлемент.НормаВремени =  НормаВремени;
			НовыйЭлемент.Записать();

		Иначе
			ЭлементСоздан = Ложь;
		КонецЕсли;
		
		// Запись цены номеклатуры.	
		Если Цена <> "" И РегистрироватьЦены И ЗначениеЗаполнено(ВидЦенРегистрации) И НЕ СсылкаНомеклатуры.Пустая() Тогда
			НоваяЦена = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
			НоваяЦена.Автор = ПараметрыСеанса.ТекущийПользователь;	
			НоваяЦена.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
			НоваяЦена.ВидЦен = ВидЦенРегистрации;
			НоваяЦена.Номенклатура = СсылкаНомеклатуры;
			НоваяЦена.Цена = Цена;
			НоваяЦена.Период = ТекущаяДата();
			НоваяЦена.Записать();
		КонецЕсли;

		// Запись штрихкода
		Если Штрихкод <> "" И НЕ СсылкаНомеклатуры.Пустая() Тогда
			НовыйШтрихКод = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			НовыйШтрихКод.Объект = СсылкаНомеклатуры;
			НовыйШтрихКод.Период = ТекущаяДата();
			НовыйШтрихКод.Штрихкод = Штрихкод;
			НовыйШтрихКод.Записать();
		КонецЕсли;	

		// Заполнение строк табличной части.
		//ОбъектНоменклатуры = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
		
		
		Если НЕ СсылкаНомеклатуры.Пустая() Тогда
			ЗначенияСтрокиТЧ = Новый Структура("Номенклатура, Количество, Упаковка, Цена");
			ЗначенияСтрокиТЧ.Номенклатура	 	= СсылкаНомеклатуры;
			ЗначенияСтрокиТЧ.Количество	  		= Число(?(ПустаяСтрока(Количество), 0, СтрЗаменить(Количество, " ", "")));
			ЗначенияСтрокиТЧ.Упаковка	  		= Справочники.УпаковкиНоменклатуры.НайтиПоНаименованию(Упаковка, Истина, , СсылкаНомеклатуры);
			ЗначенияСтрокиТЧ.Цена		  		= Число(?(ПустаяСтрока(Цена), 0, СтрЗаменить(Цена, " ", "")));
		КонецЕсли;                                
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Новый Структура("РезультатЗаписиЭлемента, ЗначенияСтрокиТЧ, ОписаниеОшибки", ?(ЭлементСоздан, 1, 0), ЗначенияСтрокиТЧ, ОписаниеОшибки);
	
КонецФункции

&НаСервере
// Функция возвращает значение реквизита справочника из переданной структуры реквизитов.
//
Функция ВернутьЗначениеРевизита(НаименованиеРеквизита, СтруктураРеквизитов)
	
	Возврат ?(СтруктураРеквизитов.Свойство(НаименованиеРеквизита), СтруктураРеквизитов[СтрЗаменить(НаименованиеРеквизита, " ", "")], "");
	
КонецФункции  

&НаКлиенте
Процедура РегистрироватьЦеныПриИзменении(Элемент)
	
	Элементы.ВидЦенРегистрации.Доступность = РегистрироватьЦены;
	
КонецПроцедуры

#КонецОбласти
